Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/social_welfare/social_welfare_payments/social_welfare_payments_to_families_and_children/maternity_benefit.html.txt.tmx
Source language: en
Languages: ga

source: Maternity Benefit is a payment made to women who are on maternity leave from work and covered by social insurance (PRSI)
ga: Is íocaíocht í a dhéantar le mná a bhíonn ar shaoire mháithreachais ón obair agus a bhfuil méid áirithe ÁSPC (Árachas Sóisialach Pá-Choibhneasa) íoctha acu

source: You should apply for the payment 6 weeks before you intend to go on maternity leave (12 weeks if you are self-employed)
ga: Caitear iarratas a dhéanamh ar an íocaíocht 6 seachtainí roimh dhul ar shaoire mháithreachais (12 seachtainí má tá tú féinfhostaithe)

source: If you are already on certain social welfare payments then you may get half-rate Maternity Benefit
ga: Braitheann an méid a íoctar leat gach seachtain ar thuilleamh

source: Some employers will continue to pay an employee, in full, while she is on maternity leave and require her to have any Maternity Benefit paid to them
ga: Má bhíonn duine ag fáil íocaíochtaí leasa shóisialaigh áirithe cheana féin, íoctar Sochar Máithreachais ag leath an ráta

source: You should check your contract of employment to see what applies to you
ga: Má bhraitheann tú gur diúltaíodh Sochar Máithreachais duit go héagórach, nó mura bhfuil tú sásta faoi chinneadh a rinne Oifigeach Cinntitheach Leasa Shóisialaigh faoi do chuid teidlíochtaí, féadfaidh tú an cinneadh seo a achomharc

source: You have the right to appeal the decision made on your Maternity Benefit claim
ga: Leanfaidh roinnt fostóirí ag íoc an fhostaí, go hiomlán, le linn di a bheith ar shaoire mháithreachais agus éileoidh an fostóir aon íocaíocht leasa shóisialaigh a íoc ar ais leis/léi

source: You can get detailed information about making an appeal from the Social Welfare Appeals Office
ga: Ba chóir duit féachaint ar do chonradh fostaíochta leis an riail a bhaineann leatsa a chinntiú

source: The Paternity Leave and Benefit Act 2016 introduced Paternity Benefit together with statutory paternity leave of 2 weeks
ga: Thug an tAcht um Shaoire agus Sochar Atharthachta 2016 íocaíocht nua Sochar Atharthachta isteach, chomh maith le 2 seachtain saoire atharthachta reachtúil

source: The combined package of paternity leave and Paternity Benefit can start at any time within the first 6 months following birth or adoption of a child
ga: Is féidir an comhphacáiste saoire atharthachta agus Sochar Atharthachta a thosú ag tréimhse ar bith taobh istigh den chéad 6 mhí tar éis breithe nó uchtaithe linbh

source: The provisions apply to births or adoptions on or after 1 September 2016
ga: Baineann na forálacha le breitheanna agus uchtuithe ar nó ón 1 Mheán Fómhair 2016

source: Taxation of Maternity Benefit
ga: Gearradh cánach ar Shochar Máithreachais

source: Maternity Benefit is taxable for all claimants
ga: Beidh Sochar Máithreachais inchánaithe ón 1 Iúil 2013 i gcás gach éilitheora

source: Universal Social Charge and PRSI are not payable
ga: Níl an Muirear Sóisialta Uilíoch agus ÁSPC le híoc

source: You can read about how Maternity Benefit is taxed in the document, Taxation of social welfare payments
ga: Féadfaidh tú a léamh faoi conas a ghearrtar cáin ar Shochar Máithreachais sa cháipéis, Gearradh cánach ar íocaíochtaí leasa shóisialaigh

source: You can also get more information from Revenue on taxation of Maternity Benefit
ga: Ina theannta sin, féadfaidh tú tuilleadh faisnéise a fháil ó na Coimisinéirí Ioncaim ar Ghearradh cánach ar Shochar Máithreachais

source: Maternity Benefit is paid by the Department of Social Protection to women who have a certain number of paid PRSI contributions on their social insurance record and who are in insurable employment up to the first day of their maternity leave
ga: Íocann an Roinn Coimirce Sóisialaí Sochar Máithreachais le mná a bhfuil méid áirithe ranníocaíochtaí ÁSPC déanta acu ar a dtaifead árachais féin agus a bhíonn in obair aitheanta suas go dtí an chéad lá dá saoire mháithreachais

source: The PRSI contributions can be from both employment or self-employment - the PRSI classes that count for Maternity Benefit are A, E, H and S (self-employed)
ga: Is féidir leis na ranníocaíochtaí teacht ó fhostaíocht nó ó fhéinfhostaíocht - is iad A, E, H agus S (féinfhostaíocht) na haicmí ÁSPC a bhíonn i gceist

source: If you are employed you must have:
ga: Má tá tú fostaithe caithfidh tú:

source: • At least 39 weeks PRSI paid in the 12-month period before the first day of your maternity leave
ga: • Ar a laghad 39 seachtainí ÁSPC a bheith íoctha agat sa tréimhse 12 mí roimh an gcéad lá de do shaoire mháithreachais;

source: • At least 39 weeks PRSI paid since first starting work and at least 39 weeks PRSI paid or credited in the relevant tax year or in the tax year immediately following the relevant tax year
ga: • Ar a laghad 39 seachtainí ÁSPC a bheith íoctha agat ó thosaigh tú ag obair agus ar a laghad 39 seachtainí ÁSPC a bheith íoctha agat nó creidiúnaithe duit sa bhliain cánach ábhartha nó sa bhliain cánach roimh an bhliain cánach ábhartha

source: For example, if you are going on maternity leave in 2017, the relevant tax year is 2015 and the year following that is 2016
ga: Mar shampla, má bhíonn tú ag dul ar shaoire mháithreachais i 2017, is í 2015 an bhliain chánach ábhartha

source: • At least 26 weeks PRSI paid in the relevant tax year and at least 26 weeks PRSI paid in the tax year immediately before the relevant tax year
ga: • Ar a laghad 26 seachtainí ÁSPC a bheith íoctha agat sa bhliain chánach ábhartha agus ar a laghad 26 seachtainí ÁSPC a bheith íoctha agat sa bhliain chánach roimh an mbliain chánach ábhartha

source: For example, if you are going on maternity leave in 2017, the relevant tax year is 2015 and the year before that is 2014
ga: Mar shampla, má bhíonn tú ag dul ar shaoire mháithreachais i 2017, is í 2015 an bhliain chánach ábhartha agus is í 2014 an bhliain chánach roimh an bhliain chánach ábhartha

source: If you do not meet these PRSI conditions and you were self-employed before starting work as an employee, you can use your Class S contributions to qualify for Maternity Benefit - see PRSI conditions for self-employed people below
ga: Mura gcomhlíonann tú na coinníollacha ÁSPC sin agus má bhí tú féinfhostaithe sular thosaigh tú ag obair mar fhostaí, féadfaidh tú do ranníocaíochtaí Aicme S a úsáid le cáiliú le haghaidh Sochair Mháithreachais - féach ar na coinníollacha ÁSPC i gcomhair daoine féinfhostaithe thíos

source: If you are self-employed you must be in insurable employment and have:
ga: Má tá tú féinfhostaithe, caithfidh tú bheith i bhfostaíocht inárachais agus:

source: • 52 weeks PRSI contributions paid at Class S in the relevant tax year
ga: • 52 seachtainí de ranníocaíochtaí ÁSPC a bheith íoctha agat ag Aicme S sa bhliain chánach ábhartha

source: For example, if you are going on maternity leave in 2017, the relevant tax year is 2015
ga: Mar shampla, má bhíonn tú ag dul ar shaoire mháithreachais i 2017, is í 2015 an bhliain chánach ábhartha

source: • 52 weeks PRSI contributions paid at Class S in the tax year immediately before the relevant tax year
ga: • 52 seachtainí de ranníocaíochtaí ÁSPC a bheith íoctha agat ag Aicme S sa bhliain chánach roimh an bhliain chánach ábhartha

source: For example, if you are going on maternity leave in 2017, the tax year immediately before the relevant tax year is 2014
ga: Mar shampla, má bhíonn tú ag dul ar shaoire mháithreachais i 2017, is í 2014 an bhliain chánach roimh an bhliain chánach ábhartha

source: • 52 weeks PRSI contributions paid at Class S in the tax year immediately following the relevant tax year
ga: • 52 seachtainí de ranníocaíochtaí ÁSPC a bheith íoctha agat ag Aicme S sa bhliain chánach cuí i ndiaidh na bliana cánach ábhartha

source: For example, if you are going on maternity leave in 2017, the tax year immediately following the relevant tax year is 2016
ga: Mar shampla, má bhíonn tú ag dul ar shaoire mháithreachais i 2017, is í 2016 sa bhliain chánach cuí i ndiaidh na bliana cánach ábhartha

source: PRSI Class S contributions for a particular year are not awarded until you have paid tax due for that year
ga: Ní bhronnfar ranníocaíochtaí Aicme ÁSPC S do bhliain ar leith go dtí go mbeidh an cháin atá dlite don bhliain sin íoctha agat

source: Your income tax and PRSI liabilities (primarily for the relevant tax year) must be paid to qualify for Maternity Benefit
ga: Ní mór do cháin ioncaim agus do dhliteanais ÁSPC (go príomha don bhliain chánach ábhartha) a bheith íoctha agat chun gur féidir leat cáiliú do Shochar Máithreachais

source: If you do not meet these PRSI conditions and you were in insurable employment before becoming self-employed, you can use your PRSI contributions (Class A, E and H) in that employment to qualify for Maternity Benefit – see PRSI conditions for employed people above
ga: Mura gcomhlíonann tú na coinníollacha ÁSPC sin agus má bhí tú ag obair i bhfostaíocht inárachais sula raibh tú féinfhostaithe, féadfaidh tú do ranníocaíochtaí ÁSPC (Aicme A, E agus H) san fhostaíocht sin a úsáid le cáiliú le haghaidh Sochair Mháithreachais - féach ar na coinníollacha ÁSPC i gcomhair daoine féinfhostaithe thuas

source: Insurance from employment in another country
ga: Árachas ó fhostaíocht i dtír eile

source: If you were previously insurably employed in a country covered by EU Regulations and you have paid at least one full rate PRSI contribution in Ireland, you may combine your insurance record in that country with your Irish PRSI contributions to help you qualify for Maternity Benefit
ga: Má bhí tú fostaithe cheana i dtír ar bhain rialacháin an AE léi, d'fhéadfá do thuairisc árachais ón tír sin a chur le do ranníocaíochtaí ÁSPC in Éirinn ar an gcoinníoll go bhfuil ar a laghad ranníocaíocht amháin ÁSPC ag an ráta iomlán íoctha agat ó tháinig tú ar ais go hÉirinn chun cabhrú leat cáiliú don Sochar Uchtaíoch

source: You must be in insurable employment in Ireland currently and have paid your most recent PRSI contribution in Ireland
ga: Níor mhór gur íoc tú ar a laghad ranníocaíocht ÁSPC iomlán amháin in Éirinn laistigh de 16 seachtaine ó dheireadh na seachtaine ina bhfuil coinne leis go saolófaí do leanbh

source: More information is available in our document about combining your social insurance contributions from abroad
ga: Tá tuilleadh eolais in ár doiciméad maidir le ranníocaíochtaí árachais shóisialta ón choigríoch a chomhcheangal

source: If you are already getting a social welfare payment
ga: Má tá tú ag fáil íocaíochta cheana féin

source: Half-rate Maternity Benefit may be payable if you are getting any one of the following payments:
ga: Íocfar Sochar Máithreachais leat ag leath an ráta má tá tú ag fáil aon cheann de na híocaíochtaí seo a leanas:

source: • Widow's and Surviving Civil Partner's (Contributory) Pension
ga: • Pinsean Baintrí nó Páirtnéara Shibhialta Mharthanaigh (Ranníocach)

source: • Widow's and Surviving Civil Partner's (Non-Contributory) Pension
ga: • Pinsean Baintrí nó Páirtnéara Shibhialta Mharthanaigh (Neamh-Ranníocach)

source: • Death Benefit by way of Widow's/Widower's/Surviving Civil Partner's or Dependent Parents' Pension (under the Occupational Injuries Scheme)
ga: • Sochar Báis mar chuid de Pinsean Baintrí (fir nó mná) nó Pinsean Tuismitheoirí Cleithiúnacha (faoin Scéim Ghortaithe Shaothair)

source: If you are providing full-time care to another person, you may qualify for half-rate Carer's Allowance with your Maternity Benefit
ga: Má tá cúram lánaimseartha á sholáthar agat do dhuine eile, féadfaidh tú cáiliú do Liúntas Cúramóra ar leathráta le do Shochar Máithreachais

source: Under the Maternity Protection Act 1994, a woman who qualifies for Maternity Benefit is entitled to claim Family Income Supplement (FIS) (provided she meets the conditions of the FIS payment and has a family – a pregnant woman who has no other children does not qualify for FIS until the birth of the baby)
ga: Faoin Acht um Chosaint Mháithreachais, 1994, tá bean a cháilítear do Shochar Máithreachais i dteideal éileamh a dhéanamh ar Fhorlíonadh Ioncam Teaghlaigh (FIT)

source: All employees must have their leave certified by their employer. However, if your contract of employment ends within 16 weeks of the end of the week in which your baby is due and you satisfy the social insurance (PRSI) conditions, Maternity Benefit is payable from the day after the date on your P45. If you are self-employed, you self-certify your leave
ga: Ní mór do gach fostaí a saoire a fháil deimhnithe ag an bhfostóir, Ach, sa chás go gcríochnaíonn do chonradh taobh istigh de 16 seachtainí den dáta a bhfuil súil aici lena leanbh agus má tá sí in ann na gcoinníollacha maidir le ranníocaíochtaí ASPC a shásamh íocfar an sochar ón lá i ndiaidh an dáta atá ar an bhfoirm P45

source: In other words, you will be required to provide your employer with a certificate from your doctor confirming when your baby is due
ga: Caithfidh tú cruthúnas a sholáthar i dtaobh an dáta a bhfuil súil leis go mbéarfaidh do chéile nó do pháirtnéir ar an leanbh

source: If you're self-employed, a doctor must complete a form MB3: Medical Certificate for Maternity Benefit (pdf) to certify the expected due date of your baby. This is to confirm that you are entitled to maternity leave
ga: I bhfriotal eile, beidh ort deimhniú a sholáthar ó dhochtúir do chéile nó do pháirtnéara shibhialta ina ndeimhnítear cathain a bhfuil súil leis go saolófar do leanbh, nó deimhniú maidir leis an dáta féin breithe má tá iarratas á dhéanamh agat i ndiaidh na breithe

source: In the case of adoption, you must produce a certificate of placement in relation to the child
ga: I gcás uchtála, caithfidh tú deimhniú socrúcháin maidir leis an leanbh a sholáthar

source: In the case of intercountry adoption that took place outside the State, you must produce a declaration of eligibility and particulars of the day of placement or expected day of placement
ga: I gcás uchtáil idirthíre a thit amach lasmuigh den Stát, caithfidh tú dearbhú incháilitheachta agus oiriúnachta maidir leis an leanbh agus critéir i scríbhinn a sholáthar a bhaineann le lá an tsocrúcháin nó leis an lá a bhfuil súil leis go ndéanfar an socrúchán

source: Duration of Maternity Benefit
ga: An t-achar ama a íoctar Sochar Máithreachais

source: Maternity Benefit is paid for 26 weeks (156 days)
ga: Íoctar Sochar Máithreachais ar feadh tréimhse 26 seachtaine

source: Maternity Benefit is a 6-day week payment which covers Monday to Saturday
ga: Is íocaíocht 6 lá í Sochar Máithreachais a chumhdaíonn Luan go Satharn

source: Sunday is not treated as a day of entitlement to Maternity Benefit
ga: Ní bhreathnaítear ar Dhomhnach mar lá teidlíochta Sochar Máithreachais

source: At least 2 weeks and not more than 16 weeks leave must be taken before the end of the week in which your baby is due
ga: Ní mór 2 sheachtain ar a laghad a ghlacadh roimh dheireadh na seachtaine ina meastar go mbéarfar do leanbh ach ní féidir níos mó na 16 seachtaine a ghlacadh roimhe

source: To ensure you take the minimum 2-week period of maternity leave before the birth of your baby, you must start your maternity leave on the Monday before the week in which your baby is due
ga: Chun cinntiú go dtógfá an íostréimhse 2 sheachtain saoire mháithreachais, caithfidh tú do shaoire mháithreachais a thosú ar an Luan roimh an tseachtain ina bhfuil do leanbh

source: For example, if your due date is Wednesday 11 October 2017, the latest date for the start of your maternity leave is Monday 2 October 2017
ga: Mar shampla, má tá do dháta dlite an Chéadaoin 11 Meán Fómhair 2017, is Luan 2 Meán Fómhair 2017 é an dáta is déanaí le haghaidh tosú do shaoire mháithreachais

source: You can take a further 16 weeks unpaid maternity leave which must be taken immediately after the end of your 26 weeks’ paid Maternity Benefit
ga: Féadfaidh tú 16 seachtaine breise de Shaoire Máithreachais gan pá ach ní bhaineann an Sochar Máithreachais leis

source: This period is not covered by Maternity Benefit but you will be entitled to a credited social insurance contribution for each week of unpaid leave you take (up to the maximum of 16)
ga: Cliceáil anseo le tuilleadh a fháil amach faoi Shaoire Mháithreachais

source: If your baby is born prematurely (before your maternity leave is due to begin), you should send a letter from your doctor to the Maternity Benefit section of the Department of Social Protection. The letter should confirm the date the baby was born and that the baby was born prematurely
ga: Má saoltar do leanbh roimh an am (is é sin roimh do do shaoire mháithreachais a bheith in ainm tosnú), ba cheart duit litir ó do dhochtúir a sheoladh ag deimhniú gur rugadh do leanbh roimh am agus an dáta a raibh súil leis an leanbh chuig an Rannóg an tSochair Mháithreachais den Roinn Coimirce Sóisialaí

source: If you have a stillbirth or miscarriage any time after the 24th week of pregnancy (i.e from the beginning of the 25th week) you are entitled to 26 weeks maternity leave. You are also entitled to 26 weeks Maternity Benefit provided you satisfy the social insurance (PRSI) requirements
ga: Má bhíonn marbh-bhreith nó breith anabaí i gceist ag am ar bith tar éis an 24ú seachtain den toircheas, tá tú i dteideal 26 seachtainí de Shochar Máithreachais agus de shaoire mháithreachais, má tá na coillíollacha ÁSPC comhlíonta agat

source: To apply for Maternity Benefit following a stillbirth, you need to send a letter from your doctor with the Maternity Benefit application form, confirming the expected date of birth, the actual date of birth and the number of weeks of pregnancy
ga: Le hiarratas a dhéanamh ar Shochar Máithreachais i gcás marbhghine, ní mór duit litir ó do dhochtúir a sheoladh in éineacht leis an bhfoirm iarratais ar Shochar Máithreachais, a dheimhníonn an dáta a raibh súil leis an leanbh, an dáta a saolaíodh an leanbh agus an líon seachtainí den toircheas a bhí caite

source: You can postpone the last 12 weeks of your maternity leave and Maternity Benefit if your child is in hospital. Your Maternity Benefit must have been in payment for at least 14 weeks and you must have taken at least 4 weeks maternity leave after your baby was born. You can postpone your Maternity Benefit for up to 6 months
ga: Má tá do leanbh á choinneáil san ospidéal, agus má bhí Sochar Máithreachais á fháil agat ar feadh 14 seachtaine ar a laghad, féadfaidh tú íocaíocht an tSochair Mháithreachais den 12 sheachtain atá fágtha a chur siar (ó 1 Márta 2007 ar aghaidh) ar feadh tréimhse chomh fada le 6 mhí

source: You should apply in writing to the Maternity Benefit Section if you want to have your Maternity Benefit postponed
ga: Ba chóir duit scríobh chuig Rannóg Shochar Máithreachais na Roinn Coimirce Sóisialaí más mian leat íocaíocht do Sochar Máithreachais a chur siar

source: Your payment will resume when you send in written confirmation to the Maternity Benefit Section that your child has been discharged from hospital and your employer certifies that you are entitled to resume your postponed maternity leave
ga: Ní mór duit scéal a chur i scríbhinn chuig Rannóg an tSochair Mháithreachais nuair a scaoiltear do leanbh amach as an ospidéal agus tosófar ag íoc na 12 sheachtain atá fágtha de do Shochar Máithreachais leat laistigh de seacht lá

source: Disqualification from Maternity Benefit
ga: Cé mar a dhéantar an íocaíocht

source: You can do voluntary work, public representative work (for example, a councillor or TD) and courses of education while you are getting Maternity Benefit
ga: Íoctar Sochar Máithreachais díreach isteach i do chuntas bainc nó i do chuntas cumann foirgníochta (cuntas reatha nó taisce, seachas cuntas morgáiste) nó d’fhéadfá a roghnú go n-íoctar é díreach isteach i gcuntas bainc d’fhostóra

source: However, your payment will be stopped if you engage in insurable (paid) employment
ga: Déantar íocaíocht gach seachtain roimh ré

source: EU and non-EU citizens can holiday abroad and get Maternity Benefit for a maximum of 6 weeks while away
ga: Dícháiliú chun Sochar Máithreachais a fháil

source: EU citizens (and citizens of Norway, Iceland, Lichtenstein or Switzerland) can get Maternity Benefit for any period of their maternity leave spent in another EU country (or in Norway, Iceland, Lichtenstein or Switzerland)
ga: Déanfar tú a dhícháiliú (cuirfear cosc ort) maidir le Sochar Máithreachais a fháil i rith na tréimhse sin ina bhfuil do Shochar iníoctha má bhíonn tú páirteach in aon fhostaíocht nó obair seachas gníomhaíochtaí tí i d’áras teaghlaigh féin

source: To get Maternity Benefit while abroad, you need to inform Maternity Benefit Section of your intended absence either by email at: maternityben@welfare.ie or by calling 01 471 5898 or Lo-call: 1890 690 690
ga: Má tá sé ar intinn agat filleadh ar do chuid fostaíochta níos luaithe ná mar atá scríofa ar d’fhoirm iarratais caithfidh tú é sin a chur in iúl do Rannóg an tSochair Mháithreachais coicís ar a laghad roimh an ‘dáta nua fillte ar an obair’

source: Maternity Benefit is paid directly into your bank or building society account (a current or deposit account, not a mortgage account) or you can choose to have it paid directly into your employer's bank account. Payment is made each week in advance
ga: Mura gcuireann tú isteach ar Shochar Máithreachais laistigh de shé mhí ón tráth a shaolaítear do leanbh, féadfaidh tú an sochar a chailliúint

source: Rate of payment from 13 March 2017
ga: Ráta ó Márta 2017

source: │Maternity │Weekly │ │Benefit │rate │
ga: │Sochar Máithreachais │Ráta seachtainiúil │

source: │Standard │€235.00 │ │payment │ │
ga: │Íocaíocht chaighdeánach │€235 │

source: If you have dependants your rate of Maternity Benefit (excluding increases for dependants) is compared to the rate of Illness Benefit (including increases for dependants) that would be paid to you if you were absent from work through illness
ga: Má tá cleithiúnaithe agat cuirtear an ráta de Shochar Máithreachais a fhaigheann tú (gan méaduithe do chleithiúnaithe a áireamh) i gcomparáid le ráta an tSochair Bhreoiteachta (méaduithe do chleithiúnaithe san áireamh) a d’íocfaí leat dá mbeifeá as láthair ón obair de bharr breoiteachta

source: The higher of the two rates is paid to you
ga: Íoctar an ráta is airde den dá ráta leat

source: Although the Illness Benefit rate begins from a lower personal base amount (€193 is the maximum Illness Benefit personal rate from 13 March 2017), it also takes into account extra payments for your family, and this is why, depending on the circumstances of your spouse, civil partner or cohabitant and how many children you have, the rate paid to you may be greater than the rate to which you would have otherwise been entitled
ga: Cé go dtosaíonn ráta an tSochair Bhreoiteachta ó bhunmhéid íseal pearsanta (is é €193 an t-uasráta pearsanta den Sochar Breoiteachta), cuireann sé i gcuntas, freisin, íocaíochtaí breise do do theaghlach, agus seo an fáth, ag brath ar chúinsí do chéile, do pháirtnéara shibhialta nó do chomháititheora agus ar cé mhéid leanaí atá agaibh, gur féidir leis an ráta a íoctar leat bheith níos mó ná an t-uasráta den Sochar Máithreachais (€235)

source: Example (March 2017 rates): Mary is entitled to the standard Maternity Benefit rate of €235
ga: Mar shampla (rátaí ó Márta 2017): Tá Mary i dteideal uasráta an tSochair Mháithreachais de €235 a fháil

source: Her partner is unemployed and signing on for unemployment credits
ga: Tá a páirtí dífhostaithe agus ag saighneáil i gcomhair creidmheasanna dífhostaíochta

source: They have two children
ga: Tá beirt leanaí acu
